article/pitfall-for-emacs-in-macOS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-10 Wed 12:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>macOS 下 Emacs新人踩坑</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">macOS 下 Emacs新人踩坑</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2266cc">1. dired 无法访问文件</a></li>
<li><a href="#orgc5598ea">2. tramp 的远端文件 PS1 环境变量问题</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd2266cc" class="outline-2">
<h2 id="orgd2266cc"><span class="section-number-2">1</span> dired 无法访问文件</h2>
<div class="outline-text-2" id="text-1">
<p>
dired 可能因为权限无法正常运行，出现下面错误
</p>
<div class="org-src-container">
<pre class="src src-text">Listing directory failed but 'access-file' worked
</pre>
</div>

<p>
解决方法:
</p>
<ol class="org-ol">
<li>进入 System Preferences -&gt; Security &amp; Privacy, 选择 Privacy tab.</li>
<li>先选左侧 Full Disk Access</li>
<li>把 ruby 加入全盘访问中</li>
</ol>
</div>
</div>

<div id="outline-container-orgc5598ea" class="outline-2">
<h2 id="orgc5598ea"><span class="section-number-2">2</span> tramp 的远端文件 PS1 环境变量问题</h2>
<div class="outline-text-2" id="text-2">
<p>
在远端 Linux 安装过 oh-my-zsh 后可能会出现 PS1 问题
</p>
<div class="org-src-container">
<pre class="src src-text">Tramp: Waiting for prompts from remote shell...failed
</pre>
</div>

<p>
解决方法:
在远端中添加如下配置
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5F7F5F; font-style: italic;"># </span><span style="color: #7F9F7F; font-style: italic;">fix emacs tramp error</span>
<span style="color: #F0DFAF; font-weight: bold;">if</span> [[ <span style="color: #CC9393;">"$TERM"</span> == <span style="color: #CC9393;">"dumb"</span> ]]; <span style="color: #F0DFAF; font-weight: bold;">then</span>
  <span style="color: #DCDCCC; font-weight: bold;">unsetopt</span> zle
  <span style="color: #DCDCCC; font-weight: bold;">unsetopt</span> prompt_cr
  <span style="color: #DCDCCC; font-weight: bold;">unsetopt</span> prompt_subst
  <span style="color: #5F7F5F; font-style: italic;"># </span><span style="color: #7F9F7F; font-style: italic;">unfunction precmd</span>
  <span style="color: #5F7F5F; font-style: italic;"># </span><span style="color: #7F9F7F; font-style: italic;">unfunction preexec</span>
  <span style="color: #DFAF8F;">PS1</span>=<span style="color: #CC9393;">'$ '</span>
<span style="color: #F0DFAF; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-11-10 Wed 12:02. Created by Jinghui Hu at 2021-11-10 Wed 11:50.</p>
</div>
</body>
</html>
